{"!leaderboards": "https://www.speedrun.com/celestep8/", "!simpleste": "https://youtu.be/mRv9Avl0Su4", "!givehug": "*hugs*", "!key": "What the fuck did you just fucking say about key%, you little bitch? I'll have you know I graduated top of my class in the Speedrunning Seals, and I've been involved in top level speedruns, and I have over 300 confirmed PBs. I am trained in finger precision and I'm the top runner in the entire leaderboards. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to key% over the Internet? Think again, fucker. As we speak I am contacting my secret network of runners across the world and your PBs are being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, kid. I can be anywhere, anytime, and I can destroy your PBs in over seven hundred ways, and that's just with my bare feet. Not only am I extensively trained in platforming precision, but I have access to the entire arsenal of the best speedrunning equipmemt in the world and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You're fucking dead, troyofathens.", "!gg": "<:yadelie:642375995961114636>", "!wr": "https://youtu.be/98y2UciWCqY", "!spikeclip": "Spikes on the floor are only programmed to kill you if madeline is falling or standing (have a vertical velocity >= 0, where positive means down), which means that if you are moving up you are completely invulnerable to spikes on the floor. We can abuse this by landing on the floor with a spike with very small upwards velocity, something like 0.01 pixels per frame upwards, which means that she will technically be moving upwards, so the spikes won't kill madeline, but the vertical velocity is so tiny that she will actually just be standing in place (although this game does have subpixels, so after a while she will move 1 pixel upwards, start falling, and die).", "!spikejump": "There's one pixel where you can be close enough to a wall to walljump but not collide with the spikes, however, it's more complicated than that, it's only possible on spikes that face to the left, and in Celeste Classic the horizontal position keeps its parity (if it's odd, then it stays odd, and if it's even, it stays even), and the pixel to walljump is an odd pixel, but you start the level on an even pixel, so we have to be careful about how we manipulate this parity. We can use empty dashes (dashing without directional input) which changes your parity, diag dashing which also changes your parity, touching walls which sets you to an odd parity, clouds which absolutely destroy every law of parity and logic, etc...", "!2500": "The height of the collision of spikes is actually smaller than the amount you move in 1 frame after dashing, so if you align it right, you can be under the spikes on 1 frame, then dash and be above the spikes on the next frame, allowing us to exit the level in 2500m.", "!gemskip": "Gemskip is a challenging category in which you skip the gem that you would normally get out of the chest in 2200m. It involves a number of advanced tricks including spike clips, spike jumps, and cornerjumps. 2300m and 2700m are considered the hardest to execute and require the most precise movement. The WR run (2:16 by Akliant917) can be seen at https://www.speedrun.com/celestep8/run/z57evr5m.", "!welcome": "Welcome! <:yadelie:642375995961114636>"}