{"!leaderboards": "https://www.speedrun.com/celestep8/", "!simpleste": "https://youtu.be/mRv9Avl0Su4", "!givehug": "*hugs*", "!key": "What the fuck did you just fucking say about key%, you little bitch? I'll have you know I graduated top of my class in the Speedrunning Seals, and I've been involved in top level speedruns, and I have over 300 confirmed PBs. I am trained in finger precision and I'm the top runner in the entire leaderboards. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to key% over the Internet? Think again, fucker. As we speak I am contacting my secret network of runners across the world and your PBs are being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, kid. I can be anywhere, anytime, and I can destroy your PBs in over seven hundred ways, and that's just with my bare feet. Not only am I extensively trained in platforming precision, but I have access to the entire arsenal of the best speedrunning equipmemt in the world and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You're fucking dead, troyofathens.", "!gg": "<:yadelie:642375995961114636>", "!wr": "https://youtu.be/98y2UciWCqY", "!spikeclip": "Spikes don't kill you if you're moving in the direction they face, and gravity isn't applied when you're directly above the ground. If you land on the ground with an upward velocity, you can clip through up-facing spikes until you're eventually lifted off of the ground. (See https://celesteclassic.github.io/glossary/#spikeclip)", "!spikejump": "If your x-coordinate has odd parity (see !parity), you can get close enough to left-facing spikes to safely walljump off of solid blocks behind them. (See https://celesteclassic.github.io/glossary/#spikejump)", "!2500": "In the early frames of a dash, a spike's hitbox can be smaller than the distance you travel in 1 frame. if a spike doesn't have a solid block behind it, e.g., the ceiling in 2500m, you can completely dash over it. (See https://celesteclassic.github.io/glossary/#spikeclip)", "!welcome": "Welcome! <:yadelie:642375995961114636>", "!tas": "https://celesteclassic.github.io/tasdatabase", "!challenges": "https://docs.google.com/spreadsheets/d/1pGfbI7BKdf5O3vNJydzVNeDQfMhkBjn5KcduVeVqXOg/edit#gid=0", "!sad": "<:sadelie:642376004853039114>", "!downloads": "Online (Practice Mod): https://celesteclassic.github.io/practice_mod.html\nWindows: https://www.speedrun.com/tools/Celeste__Practice_Mod_Win_ef7b7.zip\nMac: https://www.speedrun.com/tools/Celeste__Practice_Mod_Mac_q1h6o.zip\nLinux: https://www.speedrun.com/tools/Celeste__Practice_Mod_Linux_174ye.zip\nWeb: https://www.speedrun.com/tools/Celeste__Practice_Mod_Web_7hhrk.zip\nPICO-8: https://www.speedrun.com/tools/Celeste__Practice_Mod_PICO-8_arh2n.zip", "!commands": "```!welcome --> Welcomes a new user\n!downloads --> Links all the downloads\n!glossary --> Links to a glossary of the game's speed tech\n!db [room number] --> Shows a gif of the strat for the given level.\nNote: you can also give a category as a third optional input\n!gemskip --> Explains gemskip\n!spikeclip --> Explains spikeclips\n!2500 --> Explains Fast 2500M\n!spikejump --> Explains spikejumps\n!parity --> Explains parity\n!tas --> Links the TAS database\n!leaderboards --> Links the leaderboards\n!modleaderboards --> Links the mods leaderboards\n!key --> Copypasta\n!gg --> Sends a yadelie emote\n!sad --> Sends a sadelie emote```", "!modleaderboards": "https://www.speedrun.com/celestep8mods", "!gemskip": "Gemskip is a category in which you skip collecting the dash power-up that you would normally get out of the chest in 2200m (See https://celesteclassic.github.io/glossary/#gemskip). The WR run (2:01 by Meep_Moop) can be viewed at https://www.speedrun.com/celestep8/run/m310e8gz.", "!gun": "<:bird_with_a_gun:673959265433812995>", "!noot": "Noot noot!! XD", "!tree": "I do not believe that it is statistically possible to beat tree% without using explorer mode, or cheating in some way. I kinda think that Matt Thorson was trolling us by putting this route in the game, and having no way to tell if someone is using explorer mode just by looking at the screen footage. I think they know full well that it's impossible, and the whole thing is little more than a social experiment to see how many people will cheat and then try to pass their work off as legitimate. There is no achievement or reward for beating this route. You don't unlock a special ending where Adelie chips a tooth on the wood chips in your pie. You do get a stamp of a tree on your save file if you complete the route 25 times. But PC players have already learned to hack their save slot to manipulate these stamps - including removing the explorer stamp. \n\nCertain youtubers who shall remain nameless claim to have beaten this route legitimately within a week of the game's release - even going so far as to say that it was fairly easy to do compared to other games they've played. Having carefully inspected their videos and held extensive conversations with them and hearing their conflicting stories about why they were forced to use an explorer mode enabled save to make their videos, but did not have an explorer mode enabled save slot to show at the beginning of the videos, I am 100% certain that these are doctored videos made by nerdowells.", "!tags": "{tags: 100 - 3000, any, hundo, gemskip, nodiag, minballoon}", "!parity": "Parity refers to a state of being even or odd, and whether your position has even or odd-numbered coordinates determines whether certain options, like spike jumps, are possible. There are various ways to control your x-coordinate's parity, such as horizontally aligning yourself with the room's boundary or a solid block. (See https://celesteclassic.github.io/glossary/#parity)", "!glossary": "https://celesteclassic.github.io/glossary/", "!pingu": "EXCUSE ME, did i just get PINGED on DISCORD APP DOT COM?!?!? <:pingeline:642376244960428052> <:pingeline:642376244960428052> 🏓 <:pingeline:642376244960428052> <:pingeline:642376244960428052> \nUNACCEPTABLE. DISGRACEFUL. leaving forever bye", "!disclaimer": "**[ROUNDACTED <:roundelie:673001127301873685>]**", "!bruh": "<:roundelie:673001127301873685>", "!friedegg?": "i think you meant !friedegg dummy", "!mango": "🥭", "!irl": "That's it. I'm tired of this endless welcome-shaming. What does it matter? Isn't the intention behind the welcome more important than how perfect it is? I feel like people genuinely trying to be welcoming are getting obliterated just for being nice. It's gross. Toxic. You should all be ashamed. <:clipeline:701239859582337135>", "!whalecome": "🐋 💦", "!hack": "Alright, I've hacked into the mainframe and disabled their algorithms.", "!trueskip": "Trueskip is a secret route in the mod Everred (https://taco360.itch.io/everred) which involves skipping the first gem and completing the first two areas with only one dash. \n\nHowever, when most people talk about Trueskip, they are usually referring to the three extra levels  that take place one you get through those two areas. These, along with 3 other (much easier) levels, are collectively grouped into \"Everred Spire\", the secret fourth area.\n\nTo reach Everred Spire, you must exit 1000m with only one dash, which will automatically reroute you to the intro level. After that are three levels: Aspiration, Contemplation, and Determination, which are widely regarded as some of the hardest levels in modded Celeste.\n\nUpon clearing these levels, you'll reach Final Approach (a rehash of vanilla 2300m), and then True Summit. For your Trueskip run to be considered valid, you *must* spikeclip on the left side to reach the heart. Taking the right path will result in everyone making fun of you.\n\nThere is also a secret \"Moon Reddish\", which only spawns in True Summit if you haven't died in your current run. This was thought to not be humanly possible to obtain until people realized that it probably was."}